Problem Set 2

Question 1:

In [2]:
a = 0

def b():
    global a  # a is a global variable
    a = c(a)

def c(a):
    return a + 2

In [3]:
#Since a is global variable, the value gets updated
b()        #a=2
b()        #a=4
b()        #a=6

In [4]:
a

6

Question 2:

In [7]:
def file_length(file_name):
    try:        
        file = open(file_name)
        contents = file.read()
        file.close()
        print(len(contents))
    except:
        print("File {0} not found.".format(file_name))

In [8]:
file_length('practice.txt')

9

In [9]:
file_length('ractice.txt')

File ractice.txt not found.

Question 3:

In [10]:
class Marsupial():
    
    def __init__(self):
        self.pouch=[]
    
    def put_in_pouch(self,elt):
        self.elt=elt
        self.pouch.append(self.elt)
    
    def pouch_contents(self):    
        print(self.pouch)

In [11]:
m=Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [12]:
#subclass

class Kangaroo(Marsupial):
   
    def __init__(self,x,y):
        super().__init__()
        self.x=x
        self.y=y
        
    
    def jump(self,dx,dy):
        self.x=self.x + dx
        self.y=self.y + dy
        
    def __str__(self):
         return("I am a Kangaroo located at coordinates ({},{})".format(self.x,self.y))

In [13]:
k = Kangaroo(0,0)
print(k)

I am a Kangaroo located at coordinates (0,0)

In [14]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

['doll', 'firetruck', 'kitten']

In [15]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (3,0)

Question 4:

In [23]:
# Write function collatz() that takes a positive integer x as input and prints the
# Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying
# this rule to the previous number x in the sequence:
# x = {
# 洧논/2 洧녰洧녭 洧논 洧녰洧 洧뉧롐洧뉧롐뜦n# 3洧논 + 1 洧녰洧녭 洧논 洧녰洧 洧녶洧녬洧녬
# Your function should stop when the sequence gets to number 1. Your
# implementation must be recursive, without any loops.

In [24]:
def collatz(num):
    while True:
        print(num)
        if(num==1):
            break   
        if num%2==0:
            num=num//2
        else:
            num=3*num+1

In [25]:
collatz(1)

1

In [26]:
collatz(10)

10
5
16
8
4
2
1

Question 5:

In [17]:
# Write a recursive method binary() that takes a non-negative
# integer n and prints the binary representation of integer n.

In [18]:
#recursive method

rem=''
def bin(num):
    r=num%2
    print(r,end='')
    num=num//2
    if num>0:
        bin(num)

In [19]:
bin(0)

0

In [20]:
bin(1)

1

In [21]:
bin(3)

11

In [22]:
bin(9)

1001

Question 6:

In [61]:
# Implement a class named HeadingParser that can be used to parse an HTML
# document, and retrieve and print all the headings in the document. You should
# implement your class as a subclass of HTMLParser, defined in Standard Library
# module html.parser. When fed a string containing HTML code, your class should
# print the headings, one per line and in the order in which they appear in the
# document. Each heading should be indented as follows: an h1 heading should have

In [95]:
infile = open('w3c.html') 
content = infile.read() 
infile.close() 


from html.parser import HTMLParser

#Implementing class HeadingParser as a subclass of HTMLParser
class HeadingParser(HTMLParser):
    def handle_starttag(self, tag, attrs):
        self.tag = tag
        
        
    #function to get the indent and content
    def handle_data(self, data):
        if self.tag in {'h1','h2','h3','h4','h5','h6'}:
            indent = int(self.tag[1:2])-1
            print(' '*indent+data)
            
heading_parser = HeadingParser()

In [96]:
heading_parser.feed(content)

W3C Mission


 Principles

Question 7:

In [60]:
# Implement recursive function webdir() that takes as input: a URL (as a string) and
# non-negative integers depth and indent. Your function should visit every web
# page reachable from the starting URL web page in depth clicks or less, and print
# each web page's URL. As shown below, indentation, specified by indent, should
# be used to indicate the depth of a URL.

In [86]:
from urllib.parse import urljoin
from html.parser import HTMLParser
from urllib.request import urlopen

visited = set() 

depth=2
# recursive function
def webdir(url,depth,indent=0):
    

    # add url to set of visited pages
    global visited     
    visited.add(url)

    # returns a list of hyperlink URLs in web page url 
    links = list_url(url)

    # recursively continue crawl from every link in links
    for link in links:
        # follow link only if not visited
        if link not in visited:
            try:
                webdir(link,depth)
            except:
                pass



class Collector(HTMLParser):
    #collects hyperlink URLs into a list

    def __init__(self, url):
        
        HTMLParser.__init__(self)
        self.url = url
        self.links = []

   #collects hyperlink URLs
    def handle_starttag(self, tag, attrs):
        
        if tag == 'a':
            for attr in attrs:
                if attr[0] == 'href':
                    # constructing absolute URL
                    absolute = urljoin(self.url, attr[1])
                    if absolute[:4] == 'http': # collecting HTTP URLs
                        self.links.append(absolute)
    
   #returns hyperlinks URLs 
    def getLinks(self):
        
        return self.links
    


def list_url(url):
    
    indent=0
    n=depth
    print('{:45}'.format(url))
    
    infile = urlopen(url) 
    content = infile.read() 
    content = content.decode()
    collector = Collector(url)
    collector.feed(content)
    collector.getLinks()
    
    urls = collector.getLinks()
    
    for link in urls:
        if(n<1):
            continue
        indent+=1
        n-=1
        print('{} {:10}'.format(" "*indent,link))

    
    return urls

In [87]:
webdir('http://reed.cs.depaul.edu/lperkovic/one.html',depth,0)

http://reed.cs.depaul.edu/lperkovic/one.html
  http://reed.cs.depaul.edu/lperkovic/two.html
   http://reed.cs.depaul.edu/lperkovic/three.html
http://reed.cs.depaul.edu/lperkovic/two.html
  http://reed.cs.depaul.edu/lperkovic/four.html
http://reed.cs.depaul.edu/lperkovic/four.html
  http://reed.cs.depaul.edu/lperkovic/five.html
http://reed.cs.depaul.edu/lperkovic/five.html
  http://reed.cs.depaul.edu/lperkovic/four.html
   http://reed.cs.depaul.edu/lperkovic/one.html
http://reed.cs.depaul.edu/lperkovic/three.html
  http://reed.cs.depaul.edu/lperkovic/four.html

Question 8:

In [31]:
# Executing SQL in Jupiter:

In [32]:
# Installed using: !pip install ipython-sql
# Loaded using:
%load_ext sql

In [33]:
%sql sqlite://

In [35]:
# Creating a Table:

%%sql
CREATE TABLE weather(
    City varchar(50),
    Country varchar(50),
    Season varchar(50), Temp float,
    Rainfall float);

 * sqlite://
(sqlite3.OperationalError) table weather already exists
[SQL: CREATE TABLE weather( City varchar(50),
    Country varchar(50),
    Season varchar(50), Temp float,
    Rainfall float);]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [39]:
# Inserted the rows using Insert into table_name values (column_values)
# Displaying the entire dataset

%sql SELECT * FROM weather;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.9, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.9, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [40]:
# All Temperature Data

%sql SELECT Temp FROM weather;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.9,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.9,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [41]:
# All the cities, but without repetition.

%sql SELECT DISTINCT City FROM weather;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [42]:
# All the records for India

%sql SELECT * FROM weather WHERE Country='India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.9, 346.0)]

In [43]:
# All the Fall records

%sql SELECT * FROM weather WHERE Season='Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.9, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.9, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [44]:
# The city, country, and season for which the average rainfall is between 200
# and 400 millimeters.

%sql SELECT City,Country,Season FROM weather WHERE Rainfall>200 AND Rainfall<400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [45]:
# The city and country for which the average Fall temperature is above 20
# degrees, in increasing temperature order.

%sql SELECT City,Country, Temp FROM weather WHERE Temp>20 ORDER BY Temp;
# By default ordered in Ascending order.

 * sqlite://
Done.

[('Cairo', 'Egypt', 20.7),
 ('Cairo', 'Egypt', 22.2),
 ('Mumbai', 'India', 24.8),
 ('Cairo', 'Egypt', 27.7),
 ('Mumbai', 'India', 27.9),
 ('Mumbai', 'India', 27.9),
 ('Mumbai', 'India', 28.4)]

In [46]:
# The total annual rainfall for Cairo.

%sql SELECT SUM(Rainfall) FROM weather WHERE City='Cairo';

 * sqlite://
Done.

[(27.6,)]

In [47]:
# The total rainfall for each season.

%sql SELECT Season, SUM(Rainfall) FROM weather GROUP BY Season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

Question 9:

In [49]:
# Write list comprehension expressions that use list words and generate the following
# lists:

In [51]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

In [52]:
# a) ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE','LAZY', 'DOG']
output = [elt.upper() for elt in words]
output

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [53]:
# b) ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the','lazy', 'dog']
output = [elt.lower() for elt in words]
output

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [55]:
# c) [3, 5, 5, 3, 5, 4, 3, 4, 3] (the list of lengths of words in list words).
output = [len(elt) for elt in words]
output

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [56]:
# d) [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN','brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5],
# ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy',4], ['DOG', 'dog', 3]] 
# (the list containing a list for every word of list words, where each list contains the word in
# uppercase and lowercase and the length of the word.)

output = [[elt.upper(),elt.lower(),len(elt)] for elt in words]
output

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

In [59]:
# e) Containing elt of length 4 or more
output = [elt for elt in words if len(elt)>3]
output

['quick', 'brown', 'jumps', 'over', 'lazy']

Thank You